[Killed] Statement mutation
proyecto-si784-2024-ii-u2-contreras_paja_hernandez/ProyectoAsistencia/ProyectoAsistencia/Program.cs:4:1
 var builder = WebApplication.CreateBuilder(args);
 
 // Add services to the container.
-builder.Services.AddControllersWithViews();
+;
 
 var app = builder.Build();
killedBy: ProyectoAsistencia.Tests.UnitTest1.Get_NonExistingPage_ReturnsNotFound

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
proyecto-si784-2024-ii-u2-contreras_paja_hernandez/ProyectoAsistencia/ProyectoAsistencia/Program.cs:9:5
 var app = builder.Build();
 
 // Configure the HTTP request pipeline.
-if (!app.Environment.IsDevelopment())
+if (app.Environment.IsDevelopment())
 {
     app.UseExceptionHandler("/Home/Error");

[NoCoverage] Statement mutation
proyecto-si784-2024-ii-u2-contreras_paja_hernandez/ProyectoAsistencia/ProyectoAsistencia/Program.cs:11:5
 // Configure the HTTP request pipeline.
 if (!app.Environment.IsDevelopment())
 {
-    app.UseExceptionHandler("/Home/Error");
+    ;
     // The default HSTS value is 30 days. You may want to change this for production scenarios, see https://aka.ms/aspnetcore-hsts.
     app.UseHsts();

[Survived] Statement mutation
proyecto-si784-2024-ii-u2-contreras_paja_hernandez/ProyectoAsistencia/ProyectoAsistencia/Program.cs:23:1
 
 app.UseAuthorization();
 
-app.MapControllerRoute(
-    name: "default",
-    pattern: "{controller=Home}/{action=Index}/{id?}");
+;
 
 app.Run();
