[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:19:13
         // Métodos auxiliares para pruebas
         public static void AgregarEmpleadoParaPruebas(Empleado empleado)
         {
-            empleados.Add(empleado);
+            ;
         }
 
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionEmpleados_ReturnsViewResult_WithListOfEmpleados; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado

[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:24:13
 
         public static void AgregarAsistenciaParaPruebas(Asistencia asistencia)
         {
-            asistencias.Add(asistencia);
+            ;
         }
 
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Reportes_ReturnsViewResult_WithCorrectViewBagValues; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionAsistencias_ReturnsViewResult_WithListOfAsistencias

[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:29:13
 
         public static void LimpiarDatosPruebas()
         {
-            empleados.Clear();
+            ;
             asistencias.Clear();
             historialCambios.Clear();
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionEmpleados_ReturnsViewResult_WithListOfEmpleados; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsCorrectCounts_WhenNoData

[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:30:13
         public static void LimpiarDatosPruebas()
         {
             empleados.Clear();
-            asistencias.Clear();
+            ;
             historialCambios.Clear();
         }
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionAsistencias_ReturnsViewResult_WithListOfAsistencias; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Reportes_ReturnsCorrectData_WhenNoAsistencias

[Survived] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:31:13
         {
             empleados.Clear();
             asistencias.Clear();
-            historialCambios.Clear();
+            ;
         }
 

[Killed] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:38:61
         public IActionResult Dashboard()
         {
             ViewBag.TotalEmpleados = empleados.Count;
-            ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date == DateTime.Now.Date);
+            ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date != DateTime.Now.Date);
             ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
             ViewBag.Ausentes = asistencias.Count(a => !a.Estado && a.Fecha.Date == DateTime.Now.Date);
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues

[Killed] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:39:68
         {
             ViewBag.TotalEmpleados = empleados.Count;
             ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date == DateTime.Now.Date);
-            ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
+            ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date != DateTime.Now.Date);
             ViewBag.Ausentes = asistencias.Count(a => !a.Estado && a.Fecha.Date == DateTime.Now.Date);
             return View();
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues

[Survived] Logical mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:39:56
         {
             ViewBag.TotalEmpleados = empleados.Count;
             ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date == DateTime.Now.Date);
-            ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
+            ViewBag.Presentes = asistencias.Count(a => a.Estado || a.Fecha.Date == DateTime.Now.Date);
             ViewBag.Ausentes = asistencias.Count(a => !a.Estado && a.Fecha.Date == DateTime.Now.Date);
             return View();

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:40:55
             ViewBag.TotalEmpleados = empleados.Count;
             ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date == DateTime.Now.Date);
             ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
-            ViewBag.Ausentes = asistencias.Count(a => !a.Estado && a.Fecha.Date == DateTime.Now.Date);
+            ViewBag.Ausentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
             return View();
         }
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues

[Killed] Logical mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:40:55
             ViewBag.TotalEmpleados = empleados.Count;
             ViewBag.AsistenciasHoy = asistencias.Count(a => a.Fecha.Date == DateTime.Now.Date);
             ViewBag.Presentes = asistencias.Count(a => a.Estado && a.Fecha.Date == DateTime.Now.Date);
-            ViewBag.Ausentes = asistencias.Count(a => !a.Estado && a.Fecha.Date == DateTime.Now.Date);
+            ViewBag.Ausentes = asistencias.Count(a => !a.Estado || a.Fecha.Date == DateTime.Now.Date);
             return View();
         }
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Dashboard_ReturnsViewResult_WithCorrectViewBagValues

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:46:9
 
         // Gestión de Empleados - Lista
         public IActionResult GestionEmpleados()
-        {
-            return View(empleados);
-        }
+        {}
 
         // GET: Formulario para agregar un nuevo empleado
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionEmpleados_ReturnsViewResult_WithListOfEmpleados

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:52:9
 
         // GET: Formulario para agregar un nuevo empleado
         public IActionResult AgregarEmpleado()
-        {
-            return View();
-        }
+        {}
 
         // POST: Agregar un nuevo empleado
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_ReturnsViewResult

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:61:17
         public IActionResult AgregarEmpleado(Empleado empleado)
         {
             // Verifica si el modelo es válido
-            if (!ModelState.IsValid)
+            if (ModelState.IsValid)
             {
                 return View(empleado);
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid

[Survived] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:62:13
         {
             // Verifica si el modelo es válido
             if (!ModelState.IsValid)
-            {
-                return View(empleado);
-            }
+            {}
 
             // Validación personalizada: Verifica si el modelo es nulo o el NombreUsuario está vacío

[Killed] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:67:17
             }
 
             // Validación personalizada: Verifica si el modelo es nulo o el NombreUsuario está vacío
-            if (empleado == null || string.IsNullOrWhiteSpace(empleado.NombreUsuario))
+            if (empleado != null || string.IsNullOrWhiteSpace(empleado.NombreUsuario))
             {
                 ModelState.AddModelError("NombreUsuario", "El nombre de usuario es requerido.");
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid

[Killed] Negate expression
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:67:17
             }
 
             // Validación personalizada: Verifica si el modelo es nulo o el NombreUsuario está vacío
-            if (empleado == null || string.IsNullOrWhiteSpace(empleado.NombreUsuario))
+            if (!(empleado == null || string.IsNullOrWhiteSpace(empleado.NombreUsuario)))
             {
                 ModelState.AddModelError("NombreUsuario", "El nombre de usuario es requerido.");
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid

[NoCoverage] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:69:17
             // Validación personalizada: Verifica si el modelo es nulo o el NombreUsuario está vacío
             if (empleado == null || string.IsNullOrWhiteSpace(empleado.NombreUsuario))
             {
-                ModelState.AddModelError("NombreUsuario", "El nombre de usuario es requerido.");
+                ;
                 return View(empleado);
             }

[NoCoverage] String mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:69:59
             // Validación personalizada: Verifica si el modelo es nulo o el NombreUsuario está vacío
             if (empleado == null || string.IsNullOrWhiteSpace(empleado.NombreUsuario))
             {
-                ModelState.AddModelError("NombreUsuario", "El nombre de usuario es requerido.");
+                ModelState.AddModelError("NombreUsuario", "");
                 return View(empleado);
             }

[Killed] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:74:36
             }
 
             // Verifica si el empleado ya existe
-            if (empleados.Any(e => e.NombreUsuario == empleado.NombreUsuario))
+            if (empleados.Any(e => e.NombreUsuario != empleado.NombreUsuario))
             {
                 ModelState.AddModelError("NombreUsuario", "El empleado ya existe.");
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado

[Killed] Linq method mutation (Any() to All())
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:74:17
             }
 
             // Verifica si el empleado ya existe
-            if (empleados.Any(e => e.NombreUsuario == empleado.NombreUsuario))
+            if (empleados.All(e => e.NombreUsuario == empleado.NombreUsuario))
             {
                 ModelState.AddModelError("NombreUsuario", "El empleado ya existe.");
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid

[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:76:17
             // Verifica si el empleado ya existe
             if (empleados.Any(e => e.NombreUsuario == empleado.NombreUsuario))
             {
-                ModelState.AddModelError("NombreUsuario", "El empleado ya existe.");
+                ;
                 return View(empleado);
             }
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsError_WhenDuplicateEmpleado

[Survived] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:82:13
 
             // Asigna un ID único y agrega el empleado a la lista
             empleado.Id = empleados.Count + 1;
-            empleados.Add(empleado);
+            ;
 
             // Registrar en el historial

[Killed] String mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:90:27
                 Id = historialCambios.Count + 1,
                 Accion = "Empleado Agregado",
                 Fecha = DateTime.Now,
-                Usuario = "Admin" // En una aplicación real, esto sería el usuario autenticado
+                Usuario = "" // En una aplicación real, esto sería el usuario autenticado
             });
 
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:99:9
 
         // Gestión de Asistencias - Lista
         public IActionResult GestionAsistencias()
-        {
-            return View(asistencias);
-        }
+        {}
 
         // Historial de Cambios - Lista
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionAsistencias_ReturnsEmptyList_WhenNoAsistencias; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.GestionAsistencias_ReturnsViewResult_WithListOfAsistencias

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:105:9
 
         // Historial de Cambios - Lista
         public IActionResult HistorialCambios()
-        {
-            return View(historialCambios);
-        }
+        {}
 
         // Acción para mostrar los reportes
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.HistorialCambios_ReturnsViewResult_WithListOfHistorial; ProyectoAsistencia.Tests.Controllers.AdminControllerTests.HistorialCambios_ReturnsEmptyList_WhenNoHistorial

[Killed] Arithmetic mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:116:27
             int[] asistenciasPorMes = new int[12];
             foreach (var asistencia in asistencias)
             {
-                int mes = asistencia.Fecha.Month - 1; // Mes (0 = Enero, 11 = Diciembre)
+                int mes = asistencia.Fecha.Month + 1; // Mes (0 = Enero, 11 = Diciembre)
                 asistenciasPorMes[mes]++;
             }
killedBy: ProyectoAsistencia.Tests.Controllers.AdminControllerTests.Reportes_ReturnsViewResult_WithCorrectViewBagValues

[Survived] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:117:17
             foreach (var asistencia in asistencias)
             {
                 int mes = asistencia.Fecha.Month - 1; // Mes (0 = Enero, 11 = Diciembre)
-                asistenciasPorMes[mes]++;
+                ;
             }
 

[Survived] PostIncrementExpression to PostDecrementExpression mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:117:17
             foreach (var asistencia in asistencias)
             {
                 int mes = asistencia.Fecha.Month - 1; // Mes (0 = Enero, 11 = Diciembre)
-                asistenciasPorMes[mes]++;
+                asistenciasPorMes[mes]--;
             }
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:122:51
 
             // Calcular Presentes y Ausentes
             int presentes = asistencias.Count(a => a.Estado);
-            int ausentes = asistencias.Count(a => !a.Estado);
+            int ausentes = asistencias.Count(a => a.Estado);
 
             // Pasar los datos a la vista

[NoCoverage] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AdminController.cs:134:9
 
         // Método para obtener la lista de empleados (usado por otros controladores)
         public static List<Empleado> ObtenerEmpleados()
-        {
-            return empleados;
-        }
+        {}
     }
 }
