[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:15:9
 
         // Acción para listar todas las asistencias
         public IActionResult Index()
-        {
-            return View(asistencias);
-        }
+        {}
 
         // Acción para registrar la asistencia de un empleado
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.Index_ShouldReturnViewWithAsistencias; ProyectoAsistencia.Tests.Controllers.AsistenciaControllerTests.Index_ShouldReturnView

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:21:9
 
         // Acción para registrar la asistencia de un empleado
         public IActionResult RegistrarAsistencia()
-        {
-            ViewBag.Empleados = EmpleadoController.ObtenerEmpleados();
-            return View();
-        }
+        {}
 
         // Acción POST para registrar la asistencia
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaGet_ShouldReturnViewWithEmpleados; ProyectoAsistencia.Tests.Controllers.AsistenciaControllerTests.RegistrarAsistencia_Get_ShouldReturnView

[Killed] Linq method mutation (FirstOrDefault() to First())
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:30:28
         [HttpPost]
         public IActionResult RegistrarAsistencia(int empleadoId, bool estado)
         {
-            var empleado = EmpleadoController.ObtenerEmpleados().FirstOrDefault(e => e.Id == empleadoId);
+            var empleado = EmpleadoController.ObtenerEmpleados().First(e => e.Id == empleadoId);
             if (empleado == null) return BadRequest("Empleado no encontrado.");
 
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldAddAsistencia_WhenEmpleadoExists; ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldReturnBadRequest_WhenEmpleadoNotFound; ProyectoAsistencia.Tests.Controllers.AsistenciaControllerTests.RegistrarAsistencia_Post_ShouldReturnActionResult

[Survived] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:30:86
         [HttpPost]
         public IActionResult RegistrarAsistencia(int empleadoId, bool estado)
         {
-            var empleado = EmpleadoController.ObtenerEmpleados().FirstOrDefault(e => e.Id == empleadoId);
+            var empleado = EmpleadoController.ObtenerEmpleados().FirstOrDefault(e => e.Id != empleadoId);
             if (empleado == null) return BadRequest("Empleado no encontrado.");
 

[Killed] Equality mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:31:17
         public IActionResult RegistrarAsistencia(int empleadoId, bool estado)
         {
             var empleado = EmpleadoController.ObtenerEmpleados().FirstOrDefault(e => e.Id == empleadoId);
-            if (empleado == null) return BadRequest("Empleado no encontrado.");
+            if (empleado != null) return BadRequest("Empleado no encontrado.");
 
             var asistencia = new Asistencia
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldAddAsistencia_WhenEmpleadoExists; ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldReturnBadRequest_WhenEmpleadoNotFound; ProyectoAsistencia.Tests.Controllers.AsistenciaControllerTests.RegistrarAsistencia_Post_ShouldReturnActionResult

[Killed] String mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:31:53
         public IActionResult RegistrarAsistencia(int empleadoId, bool estado)
         {
             var empleado = EmpleadoController.ObtenerEmpleados().FirstOrDefault(e => e.Id == empleadoId);
-            if (empleado == null) return BadRequest("Empleado no encontrado.");
+            if (empleado == null) return BadRequest("");
 
             var asistencia = new Asistencia
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldAddAsistencia_WhenEmpleadoExists; ProyectoAsistencia.Tests.AsistenciaControllerTests2.RegistrarAsistenciaPost_ShouldReturnBadRequest_WhenEmpleadoNotFound

[Survived] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:42:13
                 Estado = estado
             };
 
-            asistencias.Add(asistencia);
+            ;
             return RedirectToAction("Historial");
         }

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/AsistenciaController.cs:48:9
 
         // Acción para ver el historial de asistencias
         public IActionResult Historial()
-        {
-            return View(asistencias);
-        }
+        {}
     }
 }
killedBy: ProyectoAsistencia.Tests.AsistenciaControllerTests2.Historial_ShouldReturnViewWithAsistencias; ProyectoAsistencia.Tests.Controllers.AsistenciaControllerTests.Historial_ShouldReturnView
