[Killed] Negate expression
ProyectoAsistencia/ProyectoAsistencia/Controllers/EmpleadoController.cs:21:17
         [HttpPost]
         public IActionResult AgregarEmpleado(Empleado empleado)
         {
-            if (ModelState.IsValid)
+            if (!(ModelState.IsValid))
             {
                 empleado.Id = empleados.Count + 1;
killedBy: ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid; ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.AgregarEmpleado_Post_ReturnsViewResult_WhenModelIsInvalid; ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.AgregarEmpleado_UpdatesEmpleadoList

[Killed] Statement mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/EmpleadoController.cs:24:17
             if (ModelState.IsValid)
             {
                 empleado.Id = empleados.Count + 1;
-                empleados.Add(empleado); // Agregar el empleado a la lista
+                ; // Agregar el empleado a la lista
                 return RedirectToAction("VerEmpleados");
             }
killedBy: ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.AgregarEmpleado_Post_ReturnsRedirectToAction_WhenModelIsValid; ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.AgregarEmpleado_UpdatesEmpleadoList

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/EmpleadoController.cs:33:9
 
         // Acción para ver todos los empleados registrados
         public IActionResult VerEmpleados()
-        {
-            return View(empleados);
-        }
+        {}
 
         // Método para obtener los empleados registrados
killedBy: ProyectoAsistencia.Tests.Controllers.EmpleadoControllerTests.VerEmpleados_ReturnsViewResult_WithListOfEmpleados
