[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/HomeController.cs:12:9
         private readonly ILogger<HomeController> _logger;
 
         public HomeController(ILogger<HomeController> logger)
-        {
-            _logger = logger;
-        }
+        {}
 
         public IActionResult Index()
killedBy: ProyectoAsistencia.Tests.UnitTest1.Get_HomeIndex_ReturnsSuccessStatusCode

[Killed] Block removal mutation
ProyectoAsistencia/ProyectoAsistencia/Controllers/HomeController.cs:22:9
         }
 
         public IActionResult Privacy()
-        {
-            return View();
-        }
+        {}
 
         [ResponseCache(Duration = 0, Location = ResponseCacheLocation.None, NoStore = true)]
killedBy: ProyectoAsistencia.Tests.HomeControllerTests.Privacy_ReturnsViewResult; ProyectoAsistencia.Tests.Controllers.HomeControllerTests.Privacy_ReturnsViewResult

[Survived] Null coalescing mutation (remove right)
ProyectoAsistencia/ProyectoAsistencia/Controllers/HomeController.cs:29:58
         [ResponseCache(Duration = 0, Location = ResponseCacheLocation.None, NoStore = true)]
         public IActionResult Error()
         {
-            return View(new ErrorViewModel { RequestId = Activity.Current?.Id ?? HttpContext.TraceIdentifier });
+            return View(new ErrorViewModel { RequestId = HttpContext.TraceIdentifier });
         }
     }
