[Survived] String mutation
ProyectoAsistencia/ProyectoAsistencia/Models/Administrador.cs:11:48
 
         [Required(ErrorMessage = "El username es obligatorio")]
         [RegularExpression(@"^[a-zA-Z0-9]+$", ErrorMessage = "El username solo puede contener letras y números")]
-        public string Username { get; set; } = string.Empty;
+        public string Username { get; set; } = "Stryker was here!";
 
         [Required(ErrorMessage = "La contraseña es obligatoria")]
