[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
ProyectoAsistencia/ProyectoAsistencia/Models/ErrorViewModel.cs:7:38
     {
         public string? RequestId { get; set; }
 
-        public bool ShowRequestId => !string.IsNullOrEmpty(RequestId);
+        public bool ShowRequestId => string.IsNullOrEmpty(RequestId);
     }
 }
killedBy: ProyectoAsistencia.Tests.ErrorViewModelTests.ShowRequestId_ShouldReturnTrue_WhenRequestIdIsNotNullOrEmpty; ProyectoAsistencia.Tests.ErrorViewModelTests.ShowRequestId_ShouldReturnFalse_WhenRequestIdIsNullOrEmpty; ProyectoAsistencia.Tests.Models.ErrorViewModelTests.ShowRequestId_ShouldReturnFalse_WhenRequestIdIsNull
