[Killed] Statement mutation
ProyectoAsistencia/Views/Asistencia/AgregarAsistencia.cshtml.cs:17:13
 
         public void OnPost(ProyectoAsistencia.Models.Asistencia nuevaAsistencia)
         {
-            Asistencias.Add(nuevaAsistencia);
+            ;
         }
     }
killedBy: ProyectoAsistencia.Tests.AsistenciaViewTest.AgregarAsistenciaModel_OnPost_ValidData_ShouldAddAsistencia
