[Killed] Block removal mutation
ProyectoAsistencia/Views/Asistencia/Confirmacion.cshtml.cs:13:9
         }
 
         public void OnPost(bool confirmacion)
-        {
-            IsSuccess = confirmacion;
-        }
+        {}
     }
 }
killedBy: ProyectoAsistencia.Tests.AsistenciaViewTest.ConfirmacionModel_OnPost_ValidConfirmation_ShouldSetSuccess
