[Killed] Equality mutation
ProyectoAsistencia/Views/Asistencia/FiltrarPorFecha.cshtml.cs:19:50
 
         public void OnPost(DateTime fechaInicio, DateTime fechaFin)
         {
-            Asistencias = Asistencias.Where(a => a.Fecha >= fechaInicio && a.Fecha <= fechaFin).ToList();
+            Asistencias = Asistencias.Where(a => a.Fecha > fechaInicio && a.Fecha <= fechaFin).ToList();
         }
     }
killedBy: ProyectoAsistencia.Tests.AsistenciaViewTest.FiltrarPorFechaModel_OnPost_ValidDateRange_ShouldFilterAsistencias

[Killed] Equality mutation
ProyectoAsistencia/Views/Asistencia/FiltrarPorFecha.cshtml.cs:19:50
 
         public void OnPost(DateTime fechaInicio, DateTime fechaFin)
         {
-            Asistencias = Asistencias.Where(a => a.Fecha >= fechaInicio && a.Fecha <= fechaFin).ToList();
+            Asistencias = Asistencias.Where(a => a.Fecha < fechaInicio && a.Fecha <= fechaFin).ToList();
         }
     }
killedBy: ProyectoAsistencia.Tests.AsistenciaViewTest.FiltrarPorFechaModel_OnPost_ValidDateRange_ShouldFilterAsistencias
