[Killed] Equality mutation
ProyectoAsistencia/Views/Empleado/AgregarEmpleado.cshtml.cs:17:17
 
         public void OnPost()
         {
-            if (Empleado != null)
+            if (Empleado == null)
             {
                 Empleados.Add(Empleado);
killedBy: ProyectoAsistencia.Tests.EmpleadoViewTest.AgregarEmpleadoModel_OnPost_AddsEmpleado

[Killed] Statement mutation
ProyectoAsistencia/Views/Empleado/AgregarEmpleado.cshtml.cs:19:17
         {
             if (Empleado != null)
             {
-                Empleados.Add(Empleado);
+                ;
             }
         }
killedBy: ProyectoAsistencia.Tests.EmpleadoViewTest.AgregarEmpleadoModel_OnPost_AddsEmpleado
