[Killed] Collection initializer mutation
ProyectoAsistencia/Views/Empleado/Index.cshtml.cs:12:25
 
         public void OnGet()
         {
-            Empleados = new List<ProyectoAsistencia.Models.Empleado>
-            {
-                new ProyectoAsistencia.Models.Empleado { Id = 1, NombreUsuario = "Empleado1" },
-                new ProyectoAsistencia.Models.Empleado { Id = 2, NombreUsuario = "Empleado2" }
-            };
+            Empleados = new List<ProyectoAsistencia.Models.Empleado>
+{};
         }
     }
killedBy: ProyectoAsistencia.Tests.EmpleadoViewTest.IndexModel_OnGet_PopulatesEmpleadoList
